src/Enums/ТипШтрихкода/ТипШтрихкода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипШтрихкода</name>
  <enumValues>
    <name>DataMatrix</name>
    <comment>Двумерный штрихкод, содержит GTIN.</comment>
  </enumValues>
  <enumValues>
    <name>ТШК</name>
    <comment>Линейный штрихкод, представляет номер короба.</comment>
  </enumValues>
</mdclass:Enum>

src/CommonModules/СредстваМультимедиаКлиент/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда

// Процедура воспроизводит звуковой сигнал.
// 
// Параметры:
//  КодВозврата - Число - См. КодыВозвратаСерверГлобальный
Процедура ВоспроизвестиЗвуковоеОповещениеДляКодаВозврата(Знач КодВозврата) Экспорт

    Звук = ЗвукПоКодуВозврата(КодВозврата);
    Вибрация = Истина;

    СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(Звук, Вибрация);

КонецПроцедуры

// Процедура воспроизводит звуковой сигнал, соответствующий ошибке сканирования штрихкода.
Процедура ВоспроизвестиЗвуковоеОповещениеОбОшибкеСканированияШтрихкода() Экспорт

    Звук = "error";
    Вибрация = Истина;

    СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(Звук, Вибрация);

КонецПроцедуры

// Процедура воспроизводит звуковой сигнал, соответствующий успешному сканированию штрихкода.
// 
// Параметры:
//  Тип - ПеречислениеСсылка.ТипШтрихкода
Процедура ВоспроизвестиЗвуковоеОповещениеОбУспешномСканированииШтрихкода(Знач Тип) Экспорт

    // Выбор звукового сигнала в зависимости от типа штрихкода
    Звук = "success";

    Если Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК") Тогда

        Звук = "barcode";

    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.DataMatrix") Тогда

        Звук = "datamatrix";

    КонецЕсли;

    Вибрация = Истина;

    СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(Звук, Вибрация);

КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает имя звука, соответствующего коду возврата.
// 
// Параметры:
//  КодВозврата - Число - См. КодыВозвратаСерверГлобальный
// 
// Возвращаемое значение:
//  Неопределено, Строка - Звук, соответствующий коду возврата, или Неопределено
Функция ЗвукПоКодуВозврата(Знач КодВозврата)

    Если ЭтоКодВозвратаУспех(КодВозврата) Тогда

        Возврат "success";

    ИначеЕсли ЭтоКодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаСлишкомМногоВКоробе(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаОтсутствуетДокументНаВнутреннееПеремещение(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаШтрихкодУжеПроведен(КодВозврата) Тогда

        Возврат "povtor";

    ИначеЕсли ЭтоКодВозвратаШтрихкодУжеПроведенДругим(КодВозврата) Тогда

        Возврат "chyzhoi";

    Иначе

        Возврат Неопределено;

    КонецЕсли;

КонецФункции

#КонецОбласти
